Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2019 Microchip Technology Inc.
 SPDX-License-Identifier: Apache-2.0
 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at
 http://www.apache.org/licenses/LICENSE-2.0
 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file schema-version="0.6" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd" xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
<file timestamp="2019-05-13T19:53:12Z"/>
<variants>
   <variant package="TQFP64" pinout="TQFP64" speedmax="120000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="2.2" />
   <variant package="QFN64" pinout="QFN64" speedmax="120000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="2.2" />
</variants>
<devices>
   <device architecture="MIPS" family="PIC32MK" name="PIC32MK1024GPK064" series="PIC32MK">
      <address-spaces>
         <address-space endianness="little" id="base" name="base" size="0x100000000" start="0">
            <memory-segment exec="" name="lowerbootaliasaltconfig" rw="" size="0x50" start="0x1fc03f30" type="" />
            <memory-segment exec="" name="upperbootaliasaltconfig" rw="" size="0x50" start="0x1fc23f30" type="" />
            <memory-segment exec="" name="upperbootaliasconfig" rw="" size="0x50" start="0x1fc23fb0" type="" />
            <memory-segment exec="" name="altboot1config" rw="" size="0x50" start="0x1fc43f30" type="" />
            <memory-segment exec="" name="boot1config" rw="" size="0x50" start="0x1fc43fb0" type="" />
            <memory-segment exec="" name="altboot2config" rw="" size="0x50" start="0x1fc63f30" type="" />
            <memory-segment exec="" name="boot2config" rw="" size="0x50" start="0x1fc63fb0" type="" />
            <memory-segment exec="" name="boot1" rw="" size="0x3f30" start="0x1fc40000" type="" />
            <memory-segment exec="" name="boot1lastpage" rw="" size="0x1000" start="0x1fc44000" type="" />
            <memory-segment exec="" name="boot2" rw="" size="0x3f30" start="0x1fc60000" type="" />
            <memory-segment exec="" name="boot2lastpage" rw="" size="0x1000" start="0x1fc64000" type="" />
            <memory-segment exec="" name="upperbootalias" rw="" size="0x3f30" start="0x1fc20000" type="" />
            <memory-segment exec="" name="upperbootaliaslastpage" rw="" size="0x1000" start="0x1fc24000" type="" />
            <memory-segment exec="" name="lowerbootalias" rw="" size="0x3f30" start="0x1fc00000" type="" />
            <memory-segment exec="" name="lowerbootaliaslastpage" rw="" size="0x1000" start="0x1fc04000" type="" />
            <memory-segment exec="" name="code" rw="" size="0x100000" start="0x1d000000" type="" />
            <memory-segment exec="" name="lowerbootaliasconfig" rw="" size="0x50" start="0x1fc03fb0" type="" />
            <memory-segment exec="" name="adccal" rw="" size="0x1c" start="0x1fc45000" type="" />
            <memory-segment exec="" name="serial" rw="" size="0x10" start="0x1fc45020" type="" />
            <memory-segment exec="" name="eedatacal" rw="" size="0x10" start="0x1fc45030" type="" />
            <memory-segment exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" />
            <memory-segment exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" />
            <memory-segment exec="" name="kseg0_data_mem" rw="" size="0x40000" start="0x00000000" type="" />
            <memory-segment exec="" name="periph_pb1_std" rw="" size="0x2000" start="0x1f800000" type="" />
            <memory-segment exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type="" />
            <memory-segment exec="" name="periph_pb2_std" rw="" size="0xe200" start="0x1f820000" type="" />
            <memory-segment exec="" name="periph_pb3_std" rw="" size="0xc800" start="0x1f840000" type="" />
            <memory-segment exec="" name="periph_pb4_std" rw="" size="0x700" start="0x1f860000" type="" />
            <memory-segment exec="" name="periph_pb5_std" rw="" size="0xb000" start="0x1f880000" type="" />
            <memory-segment exec="" name="periph_pb6_std" rw="" size="0x400" start="0x1f8c0000" type="" />
            <memory-segment exec="" name="periph_ssx" rw="" size="0x10000" start="0x1f8f0000" type="" />
            <memory-segment exec="" name="testmem" rw="" size="0x1000" start="0x1fc65000" type="" />
         </address-space>
      </address-spaces>
      <property-groups>
         <property-group name="SIGNATURES">
            <property name="JTAGID" value="" />
            <property name="CHIPID_CIDR" value="" />
            <property name="CHIPID_EXID" value="" />
         </property-group>
         <property-group name="LEGACY_INSTANCE_IDS" />
      </property-groups>
      <parameters>
         <param caption="MPU present or not" name="__MPU_PRESENT" value="1" />
         <param caption="Number of interrupt priority levels" name="__INT_PRIO_LEVELS" value="7" />
         <param caption="Number of interrupt subpriority levels" name="__INT_SUBPRIO_LEVELS" value="4" />
         <param caption="System Clock Default Frequency" name="__SYS_DEF_FREQ" value="120000000"/>
         <param caption="Number of DMA Channels" name="__NUM_DMA_CHANNELS" value="8"/>
         <param caption="Peripheral Bus 1 Default Clock Frequency" name="__PB1_DEF_FREQ" value="60000000"/>
         <param caption="Peripheral Bus 2 Default Clock Frequency" name="__PB2_DEF_FREQ" value="60000000"/>
         <param caption="Peripheral Bus 3 Default Clock Frequency" name="__PB3_DEF_FREQ" value="60000000"/>
         <param caption="Peripheral Bus 4 Default Clock Frequency" name="__PB4_DEF_FREQ" value="60000000"/>
         <param caption="Peripheral Bus 5 Default Clock Frequency" name="__PB5_DEF_FREQ" value="60000000"/>
         <param caption="Peripheral Bus 6 Default Clock Frequency" name="__PB6_DEF_FREQ" value="30000000"/>
         <param caption="Peripheral Bus 7 Default Clock Frequency" name="__PB7_DEF_FREQ" value="120000000"/>
         <param caption="Reference Clock 1 Default Frequency" name="__REFCLK1_DEF_FREQ" value="120000000"/>
         <param caption="Reference Clock 2 Default Frequency" name="__REFCLK2_DEF_FREQ" value="120000000"/>
         <param caption="Reference Clock 3 Default Frequency" name="__REFCLK3_DEF_FREQ" value="120000000"/>
         <param caption="Reference Clock 4 Default Frequency" name="__REFCLK4_DEF_FREQ" value="120000000"/>
         <param caption="Primary Oscillator Input Default Frequency" name="__POSC_DEF_FREQ" value="12000000"/>
         <param caption="Secondary Oscillator Input Default Frequency" name="__SOSC_DEF_FREQ" value="32768"/>
         <param caption="Peripheral Bus 1 Default Divider Value" name="__PB1_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 2 Default Divider Value" name="__PB2_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 3 Default Divider Value" name="__PB3_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 4 Default Divider Value" name="__PB4_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 5 Default Divider Value" name="__PB5_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 6 Default Divider Value" name="__PB6_DEF_DIV" value="4"/>
         <param caption="Peripheral Bus 7 Default Divider Value" name="__PB7_DEF_DIV" value="1"/>
         <param caption="Number of interrupt shadow register sets" name="__INT_NUM_SHADOW_SETS" value="7" />
      </parameters>
      <peripherals>
         <module id="02508" name="ADCHS" version="">
            <instance name="ADCHS">
               <register-group address-space="periph_pb5_std" name="ADCHS" name-in-module="ADCHS" offset="0x1f887000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01445" name="CDAC" version="">
            <instance name="CDAC1">
               <register-group address-space="periph_pb2_std" name="CDAC" name-in-module="CDAC" offset="0x1f820000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="CDAC2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
