Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
            <instance name="CDAC3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02481" name="CFG" version="">
            <instance name="CFG">
               <register-group address-space="periph_pb1_std" name="CFG" name-in-module="CFG" offset="0x1f800000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01427" name="CMP" version="">
            <instance name="CMP">
               <register-group address-space="periph_pb2_std" name="CMP" name-in-module="CMP" offset="0x1f82c000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00000" name="CORE" version="">
            <instance name="CORE">
               <register-group address-space="" name="CORE" name-in-module="CORE" offset="0x0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02823" name="CRU" version="">
            <instance name="CRU">
               <register-group address-space="periph_pb1_std" name="CRU" name-in-module="CRU" offset="0x1f801200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01461" name="CTMU" version="">
            <instance name="CTMU">
               <register-group address-space="periph_pb2_std" name="CTMU" name-in-module="CTMU" offset="0x1f82d000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01500" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph_pb1_fast" name="DMAC" name-in-module="DMAC" offset="0x1f811000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01520" name="DMT" version="">
            <instance name="DMT">
               <register-group address-space="periph_pb1_std" name="DMT" name-in-module="DMT" offset="0x1f800000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01475" name="DSCTRL" version="">
            <instance name="DSCTRL">
               <register-group address-space="periph_pb6_std" name="DSCTRL" name-in-module="DSCTRL" offset="0x1f8c0200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02819" name="EEPROM" version="">
            <instance name="EEPROM">
               <register-group address-space="periph_pb2_std" name="EEPROM" name-in-module="EEPROM" offset="0x1f829000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02467" name="GPIO" version="">
            <instance name="GPIO">
               <register-group address-space="periph_pb4_std" name="GPIO" name-in-module="GPIO" offset="0x1f860000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02511" name="HLVD" version="">
            <instance name="HLVD">
               <register-group address-space="periph_pb1_std" name="HLVD" name-in-module="HLVD" offset="0x1f801800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01441" name="I2C" version="">
            <instance name="I2C1">
               <register-group address-space="periph_pb2_std" name="I2C" name-in-module="I2C" offset="0x1f826000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00740" name="ICAP" version="">
            <instance name="ICAP1">
               <register-group address-space="periph_pb2_std" name="ICAP" name-in-module="ICAP" offset="0x1f820000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP5">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP6">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP7">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP8">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP9">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="ICAP10">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
