Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
         <register caption="Device Configuration Word 1" name="DEVCFG1" initval="0x5F74FFF9">
            <bitfield caption="Deadman Timer enable bit" mask="0x80000000" name="FDMTEN" values="DEVCFG1__FDMTEN" />
            <bitfield caption="Deadman Timer Count Select bits" mask="0x7c000000" name="DMTCNT" values="DEVCFG1__DMTCNT" />
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x3000000" name="FWDTWINSZ" values="DEVCFG1__FWDTWINSZ" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN" />
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x400000" name="WINDIS" values="DEVCFG1__WINDIS" />
            <bitfield caption="Watchdog Timer Stop During Flash Programming bit" mask="0x200000" name="WDTSPGM" values="DEVCFG1__WDTSPGM" />
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS" />
            <bitfield caption="Clock Switching and Monitoring Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM" />
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC" />
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD" />
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x40" name="FSOSCEN" values="DEVCFG1__FSOSCEN" />
            <bitfield caption="Deadman Timer Count Window Interval bits" mask="0x38" name="DMTINTV" values="DEVCFG1__DMTINTV" />
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC" />
         </register>
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0x7FFFF7DB">
            <bitfield caption="EJTAG Boot Enable bit" mask="0x40000000" name="EJTAGBEN" values="DEVCFG0__EJTAGBEN" />
            <bitfield caption="Primary Oscillator Automatic Gain Control bit" mask="0x8000000" name="POSCAGC" values="DEVCFG0__POSCAGC" />
            <bitfield caption="Primary Crystal Oscillator AGC Lock Range bit" mask="0x4000000" name="POSCAGCRNG" values="DEVCFG0__POSCAGCRNG" />
            <bitfield caption="Primary Crystal AGC Gain Search Step Settling Time Control bits" mask="0x3000000" name="POSCAGCDLY" values="DEVCFG0__POSCAGCDLY" />
            <bitfield caption="Primary Crystal Oscillator Fine Gain Control bits" mask="0xc00000" name="POSCFGAIN" values="DEVCFG0__POSCFGAIN" />
            <bitfield caption="Primary Oscillator Boost bit" mask="0x200000" name="POSCBOOST" values="DEVCFG0__POSCBOOST" />
            <bitfield caption="Primary Crystal Oscillator Course Gain Control bits" mask="0x180000" name="POSCGAIN" values="DEVCFG0__POSCGAIN" />
            <bitfield caption="Secondary Oscillator Kick Start Programmability bit" mask="0x40000" name="SOSCBOOST" values="DEVCFG0__SOSCBOOST" />
            <bitfield caption="Secondary Oscillator Gain Control bits" mask="0x30000" name="SOSCGAIN" values="DEVCFG0__SOSCGAIN" />
            <bitfield caption="Soft Master Clear Enable bit" mask="0x8000" name="SMCLR" values="DEVCFG0__SMCLR" />
            <bitfield caption="Debug Mode CPU Access Permission" mask="0x7000" name="DBGPER" values="DEVCFG0__DBGPER" />
            <bitfield caption="Flash Sleep Mode bit" mask="0x400" name="FSLEEP" values="DEVCFG0__FSLEEP" />
            <bitfield caption="Dynamic Flash ECC Configuration bits" mask="0x300" name="FECCCON" values="DEVCFG0__FECCCON" />
            <bitfield caption="Boot ISA Selection bit" mask="0x40" name="BOOTISA" values="DEVCFG0__BOOTISA" />
            <bitfield caption="Trace Enable bit" mask="0x20" name="TRCEN" values="DEVCFG0__TRCEN" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN" />
            <bitfield caption="Background Debugger Enable bits" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
         </register>
      </register-group>
      <value-group caption="" name="DEVCFG4__A1DIFFPR">
         <value caption="Uses Both PMOS and NMOS Differential Pair" name="USE_PMOS_NMOS" value="0x3" />
         <value caption="Uses NMOS Differential Pair" name="USE_NMOS" value="0x2" />
         <value caption="Use PMOS Differential Pair" name="USE_PMOS" value="0x1" />
      </value-group>
      <value-group caption="" name="DEVCFG4__A2DIFFPR">
         <value caption="Uses Both PMOS and NMOS Differential Pair" name="USE_PMOS_NMOS" value="0x3" />
         <value caption="Uses NMOS Differential Pair" name="USE_NMOS" value="0x2" />
         <value caption="Use PMOS Differential Pair" name="USE_PMOS" value="0x1" />
      </value-group>
      <value-group caption="" name="DEVCFG4__A3DIFFPR">
         <value caption="Uses Both PMOS and NMOS Differential Pair" name="USE_PMOS_NMOS" value="0x3" />
         <value caption="Uses NMOS Differential Pair" name="USE_NMOS" value="0x2" />
         <value caption="Use PMOS Differential Pair" name="USE_PMOS" value="0x1" />
      </value-group>
      <value-group caption="" name="DEVCFG4__A5DIFFPR">
         <value caption="Uses Both PMOS and NMOS Differential Pair" name="USE_PMOS_NMOS" value="0x3" />
         <value caption="Uses NMOS Differential Pair" name="USE_NMOS" value="0x2" />
         <value caption="Use PMOS Differential Pair" name="USE_PMOS" value="0x1" />
      </value-group>
      <value-group caption="UserID" name="DEVCFG3__USERID">
         <value caption="User ID" name="" />
      </value-group>
      <value-group caption="PWM Write Access Select bit" name="DEVCFG3__PWMLOCK">
         <value caption="PWM IOxCON register write accesses must use the PWMKEY unlock procedure" name="ON" value="0x0" />
         <value caption="PWM IOxCON register writes accesses are not locked or protected" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="USB2 USBID Selection bit" name="DEVCFG3__FUSBIDIO2">
         <value caption="USBID pin is controlled by the USB2 module" name="ON" value="0x1" />
         <value caption="USBID pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
