Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC3" name="ADCDSTAT__RAF3">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC4" name="ADCDSTAT__RAF4">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC5" name="ADCDSTAT__RAF5">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC0" name="ADCDSTAT__RAFIEN0">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC1" name="ADCDSTAT__RAFIEN1">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC2" name="ADCDSTAT__RAFIEN2">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC3" name="ADCDSTAT__RAFIEN3">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC4" name="ADCDSTAT__RAFIEN4">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC5" name="ADCDSTAT__RAFIEN5">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC0" name="ADCDSTAT__RBF0">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC1" name="ADCDSTAT__RBF1">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC2" name="ADCDSTAT__RBF2">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC3" name="ADCDSTAT__RBF3">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC4" name="ADCDSTAT__RBF4">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC5" name="ADCDSTAT__RBF5">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC0" name="ADCDSTAT__RBFIEN0">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC1" name="ADCDSTAT__RBFIEN1">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC2" name="ADCDSTAT__RBFIEN2">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC3" name="ADCDSTAT__RBFIEN3">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
