Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC4" name="ADCDSTAT__RBFIEN4">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="Global ADC DMA Enable bit" name="ADCDSTAT__DMAEN">
         <value caption="DMA interface is enabled" name="" value="0x1" />
         <value caption="DMA interface is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL0">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL1">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL2">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL3">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL4">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL5">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL6">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL7">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL8">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL9">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL10">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL11">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL12">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL13">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL14">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
