Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
         <register caption="FRC Tuning Register" name="OSCTUN" offset="0x10" rw="RW" size="4">
            <bitfield caption="FRC Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN" />
         </register>
         <register caption="System PLL Control Register" name="SPLLCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="System PLL Frequency Range Selection bits" mask="0x00000007" name="PLLRANGE" values="SPLLCON__PLLRANGE" />
            <bitfield caption="System PLL Input Clock Source bit" mask="0x00000080" name="PLLICLK" values="SPLLCON__PLLICLK" />
            <bitfield caption="System PLL Input Clock Divider bits" mask="0x00000700" name="PLLIDIV" values="SPLLCON__PLLIDIV" />
            <bitfield caption="System PLL Multiplier bits" mask="0x007F0000" name="PLLMULT" values="SPLLCON__PLLMULT" />
            <bitfield caption="System PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="SPLLCON__PLLODIV" />
         </register>
         <register caption="USB PLL Control Register" name="UPLLCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="System PLL Frequency Range Selection bits" mask="0x00000007" name="PLLRANGE" values="UPLLCON__PLLRANGE" />
            <bitfield caption="System PLL Input Clock Divider bits" mask="0x00000700" name="PLLIDIV" values="UPLLCON__PLLIDIV" />
            <bitfield caption="System PLL Multiplier Output Clock Divider bits" mask="0x007F0000" name="PLLMULT" values="UPLLCON__PLLMULT" />
            <bitfield caption="System PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="UPLLCON__PLLODIV" />
            <bitfield caption="Output Enable bit" mask="0x20000000" name="UPOSCEN" values="UPLLCON__UPOSCEN" />
         </register>
         <register caption="Reference Oscillator Control Register" name="REFO1CON" offset="0x80" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO1CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON" />
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO1CON_RODIV" />
         </register>
         <register caption="Reference Oscillator Control Register" name="REFO2CON" offset="0xA0" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO2CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO2CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO2CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO2CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO2CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO2CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO2CON__ON" />
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO2CON_RODIV" />
         </register>
         <register caption="Reference Oscillator Control Register" name="REFO3CON" offset="0xC0" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO3CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO3CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO3CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO3CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO3CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO3CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO3CON__ON" />
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO3CON_RODIV" />
         </register>
         <register caption="Reference Oscillator Control Register" name="REFO4CON" offset="0xE0" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO4CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO4CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO4CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO4CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO4CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO4CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO4CON__ON" />
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO4CON_RODIV" />
         </register>
