Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO3CON__SIDL">
         <value caption="Discontinue module operation when the device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO3CON__ON">
         <value caption="Reference Oscillator Module enabled" name="" value="0x1" />
         <value caption="Reference Oscillator Module disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO3CON__RODIV">
         <value caption="REFO clock is Base clock frequency divided by 65534" name="" value="0x7fff"/>
         <value caption="REFO clock is Base clock frequency divided by 6 (3*2)" name="" value="0x3"/>
         <value caption="REFO clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2"/>
         <value caption="REFO clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1"/>
         <value caption="REFO is the same frequency as Base Clock (no divider)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO4CON__ROSEL">
         <value caption="Reference Clock Input REFCLKI" name="REFCLKI" value="0x8" />
         <value caption="System PLL Output SPLL" name="SPLL" value="0x7" />
         <value caption="USB PLL UPLL" name="UPLL" value="0x6" />
         <value caption="Secondary Oscillator SOSC" name="Sosc" value="0x5" />
         <value caption="Low Power Oscillator LPRC" name="LPRC" value="0x4" />
         <value caption="Internal Fast Oscillator FRC" name="FRC" value="0x3" />
         <value caption="Primary Oscillator POSC" name="Posc" value="0x2" />
         <value caption="Peripheral Clock 1 PBCLK1" name="PBCLK1" value="0x1" />
         <value caption="System clock SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO4CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO4CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO4CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO4CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO4CON__SIDL">
         <value caption="Discontinue module operation when the device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO4CON__ON">
         <value caption="Reference Oscillator Module enabled" name="" value="0x1" />
         <value caption="Reference Oscillator Module disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO4CON__RODIV">
         <value caption="REFO clock is Base clock frequency divided by 65534" name="" value="0x7fff"/>
         <value caption="REFO clock is Base clock frequency divided by 6 (3*2)" name="" value="0x3"/>
         <value caption="REFO clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2"/>
         <value caption="REFO clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1"/>
         <value caption="REFO is the same frequency as Base Clock (no divider)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFO1TRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFO2TRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFO3TRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFO4TRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB1DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x &lt; 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
