Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
         <register caption="DMA Channel x Pattern Data Register" name="DCH1DAT" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH2DAT" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH3DAT" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH4DAT" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH5DAT" offset="0x4d0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH6DAT" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH7DAT" offset="0x650" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
      </register-group>
      <value-group caption="DMA Module Busy bit" name="DMACON__DMABUSY">
         <value caption="DMA module is active and is transferring data" name="" value="0x1" />
         <value caption="DMA module is disabled and not actively transferring data" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Suspend bit" name="DMACON__SUSPEND">
         <value caption="DMA transfers are suspended to allow CPU uninterrupted access to data bus" name="" value="0x1" />
         <value caption="DMA operates normally" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA On bit" name="DMACON__ON">
         <value caption="DMA module is enabled" name="" value="0x1" />
         <value caption="DMA module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Status bit" name="DMASTAT__RDWR">
         <value caption="Last DMA bus access when an error was detected was a read" name="" value="0x1" />
         <value caption="Last DMA bus access when an error was detected was a write" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Channel Select bits" name="DCRCCON__CRCCH">
         <value caption="CRC is assigned to Channel 7" name="" value="0x7" />
         <value caption="CRC is assigned to Channel 6" name="" value="0x6" />
         <value caption="CRC is assigned to Channel 5" name="" value="0x5" />
         <value caption="CRC is assigned to Channel 4" name="" value="0x4" />
         <value caption="CRC is assigned to Channel 3" name="" value="0x3" />
         <value caption="CRC is assigned to Channel 2" name="" value="0x2" />
         <value caption="CRC is assigned to Channel 1" name="" value="0x1" />
         <value caption="CRC is assigned to Channel 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Type Selection bit" name="DCRCCON__CRCTYP">
         <value caption="The CRC module will calculate an IP header checksum" name="" value="0x1" />
         <value caption="The CRC module will calculate a LFSR CRC" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Append Mode bit" name="DCRCCON__CRCAPP">
         <value caption="The DMA transfers data from the source into the CRC but NOT to the destination. When a block transfer completes the DMA writes the calculated CRC value to the location given by CHxDSA" name="" value="0x1" />
         <value caption="The DMA transfers data from the source through the CRC obeying WBO as it writes the data to the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Enable bit" name="DCRCCON__CRCEN">
         <value caption="CRC module is enabled and channel transfers are routed through the CRC module" name="" value="0x1" />
         <value caption="CRC module is disabled and channel transfers proceed normally" name="" value="0x0" />
      </value-group>
      <value-group caption="Polynomial Length bits" name="DCRCCON__PLEN">
         <value caption="(CRC module is in IP Header mode)These bits are unused / (CRC module is in LFSR mode)Denotes the polynomial length is 2" name="" value="0x3" />
         <value caption="(CRC module is in IP Header mode)These bits are unused / (CRC module is in LFSR mode)Denotes the polynomial length is 1" name="" value="0x2" />
      </value-group>
      <value-group caption="CRC Bit Order Selection bit" name="DCRCCON__BITO">
         <value caption="(When CRCTYP is 1)The IP header checksum is calculated Least Significant bit (LSb) first / (When CRCTYP is 0)The LFSR CRC is calculated Least Significant bit first" name="" value="0x1" />
         <value caption="(When CRCTYP is 1)The IP header checksum is calculated Most Significant bit (LSb) first / (When CRCTYP is 0)The LFSR CRC is calculated Most Significant bit first" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Write Byte Order Selection bit" name="DCRCCON__WBO">
         <value caption="Source data is written to the destination re-ordered as defined by BYTO" name="" value="0x1" />
         <value caption="Source data is written to the destination unaltered" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Byte Order Selection bits" name="DCRCCON__BYTO">
         <value caption="Endian byte swap on half-word boundaries" name="" value="0x3" />
         <value caption="Swap half-words on word boundaries" name="" value="0x2" />
         <value caption="Endian byte swap on word boundaries" name="" value="0x1" />
         <value caption="No swapping" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC XOR Register bits" name="DCRCXOR__DCRCXOR">
         <value caption="(When CRCTYP is 0) Enable the XOR input to the Shift register / (When CRCTYP is 1) This register is unused" name="" value="0x1" />
         <value caption="(When CRCTYP is 0) Disable the XOR input to the Shift register; data is shifted in directly from the previous stage in the register/ When CRCTYP is 1) This register is unused" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH0CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="" value="0x3" />
         <value caption="Channel has priority 2" name="" value="0x2" />
         <value caption="Channel has priority 1" name="" value="0x1" />
         <value caption="Channel has priority 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH0CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH0CON__CHAEN">
         <value caption="Channel is continuously enabled" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH0CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH0CON__CHAED">
         <value caption="Channel start/abort events will be registered" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH0CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
