Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
      <value-group caption="Channel Cell-Size bits" name="DCH6CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH7CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH0CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH1CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH2CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH3CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH4CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH5CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH6CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH7CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01520" name="DMT" version="1">
      <register-group name="DMT">
         <register caption="Deadman Timer Control Register" name="DMTCON" offset="0x0E00" rw="RW" size="4">
            <bitfield caption="Deadman Timer Module Enable bit" mask="0x00008000" name="ON" values="DMTCON__ON" />
         </register>
         <register caption="Deadman Timer Preclear Register" name="DMTPRECLR" offset="0x0E10" rw="RW" size="4">
            <bitfield caption="Preclear Enable bits" mask="0x0000FF00" name="STEP1" values="DMTPRECLR__STEP1" />
         </register>
         <register caption="Deadman Timer Clear Register" name="DMTCLR" offset="0x0E20" rw="RW" size="4">
            <bitfield caption="Clear Timer bits" mask="0x000000FF" name="STEP2" values="DMTCLR__STEP2" />
         </register>
         <register caption="Deadman Timer Status Register" name="DMTSTAT" offset="0x0E30" rw="R" size="4">
            <bitfield caption="Deadman Timer Clear Window bit" mask="0x00000001" name="WINOPN" values="DMTSTAT__WINOPN" />
            <bitfield caption="Deadman Timer Event bit" mask="0x00000020" name="DMTEVENT" values="DMTSTAT__DMTEVENT" />
            <bitfield caption="Bad STEP1/STEP2 Value Detect bit" mask="0x000000C0" name="BAD" values="DMTSTAT__BAD" />
         </register>
         <register caption="Deadman Timer Count Register" name="DMTCNT" offset="0x0E40" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="COUNTER" />
         </register>
         <register caption="Post Status Configure DMT Count Status Register" name="DMTPSCNT" offset="0x0E60" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="PSCNT" />
         </register>
         <register caption="Post Status Configure DMT Interval Status Register" name="DMTPSINTV" offset="0x0E70" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="PSINTV" />
         </register>
      </register-group>
      <value-group caption="Deadman Timer Module Enable bit" name="DMTCON__ON">
         <value caption="Deadman Timer module is enabled" name="" value="0x1" />
         <value caption="Deadman Timer module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Preclear Enable bits" name="DMTPRECLR__STEP1">
         <value caption="Enables the Deadman Timer Preclear (Step 1)" name="" value="0x40" />
      </value-group>
      <value-group caption="Clear Timer bits" name="DMTCLR__STEP2">
         <value caption="Clears STEP1" name="" value="0x8" />
      </value-group>
      <value-group caption="Deadman Timer Clear Window bit" name="DMTSTAT__WINOPN">
         <value caption="Deadman timer clear window is open" name="" value="0x1" />
         <value caption="Deadman timer clear window is not open" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Event bit" name="DMTSTAT__DMTEVENT">
         <value caption="Deadman timer event was detected (counter expired or bad STEP1 or STEP2 value was entered prior to counter increment)" name="" value="0x1" />
         <value caption="Deadman timer even was not detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Bad STEP1/STEP2 Value Detect bits" name="DMTSTAT__BAD">
         <value caption="Incorrect STEP2 value was detected / Incorrect STEP1 value was detected" name="" value="0x3" />
         <value caption="Incorrect STEP2 value was not detected / Incorrect STEP1 value was detected" name="" value="0x2" />
         <value caption="Incorrect STEP2 value was detected / Incorrect STEP1 value was not detected" name="" value="0x1" />
         <value caption="Incorrect STEP2 value was not detected / Incorrect STEP1 value was not detected" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01475" name="DSCTRL" version="2">
      <register-group name="DSCTRL">
         <register caption="" name="DSCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="I/O Pin State Release bit" mask="0x00000001" name="RELEASE" values="DSCON__RELEASE" />
            <bitfield caption="Deep Sleep BOR Event Status bit" mask="0x00000002" name="DSBOR" values="DSCON__DSBOR" />
            <bitfield caption="RTCC Wake-up Disable bit" mask="0x00000100" name="RTCCWDIS" values="DSCON__RTCCWDIS" />
            <bitfield caption="RTCC Module Disable bit" mask="0x00001000" name="RTCDIS" values="DSCON__RTCDIS" />
            <bitfield caption="General Purpose Registers Enable bit" mask="0x00002000" name="DSGPREN" values="DSCON__DSGPREN" />
            <bitfield caption="Deep Sleep Enable bit" mask="0x00008000" name="DSEN" values="DSCON__DSEN" />
         </register>
         <register caption="" name="DSWAKE" offset="0x4" rw="RW" size="4">
            <bitfield caption="MCLR Event bit" mask="0x00000004" name="DSMCLR" values="DSWAKE__DSMCLR" />
            <bitfield caption="Real-Time Clock and Calendar Alarm bit" mask="0x00000008" name="DSRTC" values="DSWAKE__DSRTC" />
            <bitfield caption="Deep Sleep Watchdog Timer Time-out bit" mask="0x00000010" name="DSWDT" values="DSWAKE__DSWDT" />
            <bitfield caption="Deep Sleep Fault Detected bit" mask="0x00000080" name="DSFLT" values="DSWAKE__DSFLT" />
            <bitfield caption="Interrupt-on-Change bit" mask="0x00000100" name="DSINT0" values="DSWAKE__DSINT0" />
         </register>
