Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
      <value-group caption="Write Strobe Polarity bit" name="PMCON__WRSP">
         <value caption="(Slave and Master mode 2) Write strobe active-high / (Master mode 1) Enable strobe active-high" name="" value="0x1" />
         <value caption="(Slave and Master mode 2) Write strobe active-low / (Master mode 1) Enable strobe active-low" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 0 Polarity bit" name="PMCON__CS1P">
         <value caption="Active-high (PMCS1)" name="" value="0x1" />
         <value caption="Active-low (PMCS1)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 Polarity bit" name="PMCON__CS2P">
         <value caption="Active-high (PMCS2)" name="" value="0x1" />
         <value caption="Active-low (PMCS2)" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Latch Polarity bit" name="PMCON__ALP">
         <value caption="Active-high (PMCS2) / (PMPCS2a)" name="" value="0x1" />
         <value caption="Active-low (PMCS2) / (PMPCS2a)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select Function bits" name="PMCON__CSF">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="PMCS2/(a) and PMCS1/(a) used as Chip Select" name="" value="0x2" />
         <value caption="PMCS2/(a) used as Chip Select, PMCS1/(a) used as address bit 14 or (22 when EXADR = 1)" name="" value="0x1" />
         <value caption="PMCS2/(a) and PMCS1/(a) used as address bits (15 and 14) or (23 and 22 when EXADR = 1)" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Strobe Port Enable bit" name="PMCON__PTRDEN">
         <value caption="PMRD/PMWR port is enabled" name="" value="0x1" />
         <value caption="PMRD/PMWR port is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Enable Strobe Port Enable bit" name="PMCON__PTWREN">
         <value caption="PMWR/PMENB port is enabled" name="" value="0x1" />
         <value caption="PMWR/PMENB port is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PMP Module TTL Input Buffer Select bit" name="PMCON__PMPTTL">
         <value caption="PMP module uses TTL input buffers" name="" value="0x1" />
         <value caption="PMP module uses Schmitt Trigger input buffer" name="" value="0x0" />
      </value-group>
      <value-group caption="Address/Data Multiplexing Selection bits" name="PMCON__ADRMUX">
         <value caption="All 16-bit of address are multiplexed with the 16-bits of data (PMA(15:0) or PMD(15:0)) using two phases" name="" value="0x3" />
         <value caption="All 16-bit of address are multiplexed with the lower 8-bits of data (PMA(15:8), PMA(7:0), or PMD(7:0)) using three phasess" name="" value="0x2" />
         <value caption="Lower 8-bits of address are multiplexed with lower 8-bits of data (PMA(7:0) or PMD(7:0))" name="" value="0x1" />
         <value caption="Address and data pins are not multiplexed" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="PMCON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Parallel Master Port Enable bit" name="PMCON__ON">
         <value caption="PMP is enabled" name="" value="0x1" />
         <value caption="PMP is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Parallel Master Port Extended 24-bit Addressing bit (Master mode only)" name="PMCON__EXADR">
         <value caption="PMP 24-bit addressing is enabled" name="" value="0x0" />
         <value caption="PMP 24-bit addressing is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Dual Read/Write Buffers enable bit" name="PMCON__DUALBUF">
         <value caption="PMP uses separate registers for reads and writes" name="" value="0x1" />
         <value caption="PMP uses legacy registers for reads and writes" name="" value="0x0" />
      </value-group>
      <value-group caption="Start Read on PMP Bus bit" name="PMCON__RDSTART">
         <value caption="Start a read cycle on the PMP bus" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Hold After Read/Write Strobe Wait States bits" name="PMMODE__WAITE">
         <value caption="(for writes) Wait of 4 Tpb / (for reads) Wait of 3 Tpb" name="" value="0x3" />
         <value caption="(for writes) Wait of 3 Tpb / (for reads) Wait of 2 Tpb" name="" value="0x2" />
         <value caption="(for writes) Wait of 2 Tpb / (for reads) Wait of 1 Tpb" name="" value="0x1" />
         <value caption="(for writes) Wait of 1 Tpb (default) / (for reads) Wait of 0 Tpb (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Read/Write Strobe Wait States bits" name="PMMODE__WAITM">
         <value caption="Wait of 16 Tpb" name="" value="0xf" />
         <value caption="Wait of 2 Tpb" name="" value="0x1" />
         <value caption="Wait of 1 Tpb (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Setup to Read/Write Strobe Wait States bits" name="PMMODE__WAITB">
         <value caption="Data wait of 4 Tpb" name="" value="0x3" />
         <value caption="Data wait of 3 Tpb" name="" value="0x2" />
         <value caption="Data wait of 2 Tpb" name="" value="0x1" />
         <value caption="Data wait of 1 Tpb" name="" value="0x0" />
      </value-group>
      <value-group caption="Parallel Port Mode Select bits" name="PMMODE__MODE">
         <value caption="PMP mode, control signals (PMA(23/15:0), PMD(23/15:0), PMCS2(a), PMCS1(a), PMRD/PMWR, PMENB)" name="" value="0x3" />
         <value caption="PMP mode, control signals (PMA(23/15:0), PMD(23/15:0), PMCS2(a), PMCS1(a), PMRD, PMWR)" name="" value="0x2" />
         <value caption="Enhanced PSP mode, control signals (PMRD, PMWR, PMCS1, PMD(7:0), and PMA(1:0))" name="" value="0x1" />
         <value caption="Legacy Parallel Slave Port mode, control signals (PMRD, PMWR, PMCS1, and PMD(7:0)))" name="" value="0x0" />
      </value-group>
