Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
         <register caption="SPI Status Register" name="SPI6STAT" offset="0x7A10" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI6STAT__SPIRBF" />
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI6STAT__SPITBF" />
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI6STAT__SPITBE" />
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI6STAT__SPIRBE" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI6STAT__SPIROV" />
            <bitfield caption="Shift Register Empty bit" mask="0x00000080" name="SRMT" values="SPI6STAT__SRMT" />
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI6STAT__SPITUR" />
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI6STAT__SPIBUSY" />
            <bitfield caption="SPI Frame Error status bit" mask="0x00001000" name="FRMERR" values="SPI6STAT__FRMERR" />
            <bitfield mask="0x001F0000" name="TXBUFELM" />
            <bitfield mask="0x1F000000" name="RXBUFELM" />
         </register>
         <register caption="" name="SPI1BUF" offset="0x7020" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI1BUF" />
         </register>
         <register caption="" name="SPI2BUF" offset="0x7220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI2BUF" />
         </register>
         <register caption="" name="SPI3BUF" offset="0x7420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI3BUF" />
         </register>
         <register caption="" name="SPI4BUF" offset="0x7620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI4BUF" />
         </register>
         <register caption="" name="SPI5BUF" offset="0x7820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI5BUF" />
         </register>
         <register caption="" name="SPI6BUF" offset="0x7A20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI6BUF" />
         </register>
         <register caption="Baud Rate Generator Divisor bits" name="SPI1BRG" offset="0x7030" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI1BRG" />
         </register>
         <register caption="Baud Rate Generator Divisor bits" name="SPI2BRG" offset="0x7230" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI2BRG" />
         </register>
         <register caption="Baud Rate Generator Divisor bits" name="SPI3BRG" offset="0x7430" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI3BRG" />
         </register>
         <register caption="Baud Rate Generator Divisor bits" name="SPI4BRG" offset="0x7630" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI4BRG" />
         </register>
         <register caption="Baud Rate Generator Divisor bits" name="SPI5BRG" offset="0x7830" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI5BRG" />
         </register>
         <register caption="Baud Rate Generator Divisor bits" name="SPI6BRG" offset="0x7A30" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="SPI6BRG" />
         </register>
         <register caption="SPI Control Register 2" name="SPI1CON2" offset="0x7040" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI1CON2__AUDMOD" />
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI1CON2__AUDMONO" />
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI1CON2__AUDEN" />
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI1CON2__IGNTUR" />
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI1CON2__IGNROV" />
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI1CON2__SPITUREN" />
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI1CON2__SPIROVEN" />
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI1CON2__FRMERREN" />
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI1CON2__SPISGNEXT" />
         </register>
         <register caption="SPI Control Register 2" name="SPI2CON2" offset="0x7240" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI2CON2__AUDMOD" />
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI2CON2__AUDMONO" />
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI2CON2__AUDEN" />
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI2CON2__IGNTUR" />
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI2CON2__IGNROV" />
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI2CON2__SPITUREN" />
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI2CON2__SPIROVEN" />
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI2CON2__FRMERREN" />
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI2CON2__SPISGNEXT" />
         </register>
         <register caption="SPI Control Register 2" name="SPI3CON2" offset="0x7440" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI3CON2__AUDMOD" />
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI3CON2__AUDMONO" />
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI3CON2__AUDEN" />
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI3CON2__IGNTUR" />
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI3CON2__IGNROV" />
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI3CON2__SPITUREN" />
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI3CON2__SPIROVEN" />
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI3CON2__FRMERREN" />
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI3CON2__SPISGNEXT" />
         </register>
         <register caption="SPI Control Register 2" name="SPI4CON2" offset="0x7640" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI4CON2__AUDMOD" />
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI4CON2__AUDMONO" />
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI4CON2__AUDEN" />
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI4CON2__IGNTUR" />
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI4CON2__IGNROV" />
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI4CON2__SPITUREN" />
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI4CON2__SPIROVEN" />
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI4CON2__FRMERREN" />
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI4CON2__SPISGNEXT" />
         </register>
         <register caption="SPI Control Register 2" name="SPI5CON2" offset="0x7840" rw="RW" size="4">
            <bitfield caption="Audio Protocol Mode bit" mask="0x00000003" name="AUDMOD" values="SPI5CON2__AUDMOD" />
            <bitfield caption="Transmit Audio Data Format bit" mask="0x00000008" name="AUDMONO" values="SPI5CON2__AUDMONO" />
            <bitfield caption="Enable Audio CODEC Support bit" mask="0x00000080" name="AUDEN" values="SPI5CON2__AUDEN" />
            <bitfield caption="Ignore Transmit Underrun bit" mask="0x00000100" name="IGNTUR" values="SPI5CON2__IGNTUR" />
            <bitfield caption="Ignore Receive Overflow bit" mask="0x00000200" name="IGNROV" values="SPI5CON2__IGNROV" />
            <bitfield caption="Enable Interrupt Events via SPITUR bit" mask="0x00000400" name="SPITUREN" values="SPI5CON2__SPITUREN" />
            <bitfield caption="Enable Interrupt Events via SPIROV bit" mask="0x00000800" name="SPIROVEN" values="SPI5CON2__SPIROVEN" />
            <bitfield caption="Enable Interrupt Events via FRMERR bit" mask="0x00001000" name="FRMERREN" values="SPI5CON2__FRMERREN" />
            <bitfield caption="Sign Extend Read Data from the RX FIFO bit" mask="0x00008000" name="SPISGNEXT" values="SPI5CON2__SPISGNEXT" />
         </register>
