Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/atdf/PIC32MK1024GPK064.atdf
      <value-group caption="Endpoint Receive Enable bit" name="U1EP14__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP14__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP15__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP15__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP15__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP15__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP15__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02674" name="WDT" version="">
      <register-group name="WDT">
         <register caption="Watchdog Timer Control Register" name="WDTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x00000001" name="WDTWINEN" values="WDTCON__WDTWINEN" />
            <bitfield mask="0x0000003E" name="SLPDIV" />
            <bitfield mask="0x00001F00" name="RUNDIV" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="ON" values="WDTCON__ON" />
            <bitfield mask="0xFFFF0000" name="WDTCLRKEY" />
         </register>
      </register-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="WDTCON__WDTWINEN">
         <value caption="Enable windowed Watchdog Timer" name="" value="0x1" />
         <value caption="Disable windowed Watchdog Timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="WDTCON__ON">
         <value caption="The WDT is enabled" name="" value="0x1" />
         <value caption="The WDT is disabled" name="" value="0x0" />
      </value-group>
   </module>
</modules>
<pinouts/>
</avr-tools-device-file>
